geosmall/Arduino_Core_STM32/boards.txt
# See: https://arduino.github.io/arduino-cli/latest/platform-specification/

menu.pnum=Board part number

menu.xserial=U(S)ART support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)
menu.virtio=Virtual serial support

menu.opt=Optimize
menu.dbg=Debug symbols and core logs
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

################################################################################
# Flight Controller boards

Flight_ctrl.name=Flight Controllers

Flight_ctrl.build.core=arduino
Flight_ctrl.build.board=Flight_ctrl
Flight_ctrl.build.variant_h=variant_{build.board}.h
Flight_ctrl.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
Flight_ctrl.upload.maximum_size=0
Flight_ctrl.upload.maximum_data_size=0

# FC_REVO_F405RG board
Flight_ctrl.menu.pnum.FC_REVO_F405RG=Revo F405RG
Flight_ctrl.menu.pnum.FC_REVO_F405RG.node="NODE_F405RG,REVO"
Flight_ctrl.menu.pnum.FC_REVO_F405RG.upload.maximum_size=1048576
Flight_ctrl.menu.pnum.FC_REVO_F405RG.upload.maximum_data_size=131072
Flight_ctrl.menu.pnum.FC_REVO_F405RG.build.mcu=cortex-m4
Flight_ctrl.menu.pnum.FC_REVO_F405RG.build.fpu=-mfpu=fpv4-sp-d16
Flight_ctrl.menu.pnum.FC_REVO_F405RG.build.float-abi=-mfloat-abi=hard
Flight_ctrl.menu.pnum.FC_REVO_F405RG.build.board=FC_REVO_F405RG
Flight_ctrl.menu.pnum.FC_REVO_F405RG.build.series=STM32F4xx
Flight_ctrl.menu.pnum.FC_REVO_F405RG.build.product_line=STM32F405xx
Flight_ctrl.menu.pnum.FC_REVO_F405RG.build.variant=STM32F4xx/FC_Revo_F405RG
Flight_ctrl.menu.pnum.FC_REVO_F405RG.build.cmsis_lib_gcc=arm_cortexM4lf_math

# Upload menu
Flight_ctrl.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Flight_ctrl.menu.upload_method.swdMethod.upload.protocol=0
Flight_ctrl.menu.upload_method.swdMethod.upload.options=-g
Flight_ctrl.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Flight_ctrl.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Flight_ctrl.menu.upload_method.serialMethod.upload.protocol=1
Flight_ctrl.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
Flight_ctrl.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Flight_ctrl.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Flight_ctrl.menu.upload_method.dfuMethod.upload.protocol=2
Flight_ctrl.menu.upload_method.dfuMethod.upload.options=-g
Flight_ctrl.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

Flight_ctrl.menu.upload_method.clipboard=Clipboard (Copy Path)
Flight_ctrl.menu.upload_method.clipboard.upload.protocol=0
Flight_ctrl.menu.upload_method.clipboard.upload.options=-g
Flight_ctrl.menu.upload_method.clipboard.upload.tool=clipboard_upload

################################################################################
# Dev boards

Dev_boards.name=Development Boards

Dev_boards.build.core=arduino
Dev_boards.build.board=Dev_boards
Dev_boards.build.variant_h=variant_{build.board}.h
Dev_boards.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
Dev_boards.upload.maximum_size=0
Dev_boards.upload.maximum_data_size=0

# BlackPill F401CC
Dev_boards.menu.pnum.BLACKPILL_F401CC=BlackPill F401CC
Dev_boards.menu.pnum.BLACKPILL_F401CC.node="NODE_F401CC,BlkPill"
Dev_boards.menu.pnum.BLACKPILL_F401CC.upload.maximum_size=262144
Dev_boards.menu.pnum.BLACKPILL_F401CC.upload.maximum_data_size=65536
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.mcu=cortex-m4
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.fpu=-mfpu=fpv4-sp-d16
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.float-abi=-mfloat-abi=hard
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.board=BLACKPILL_F401CC
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.series=STM32F4xx
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.product_line=STM32F401xC
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.variant=STM32F4xx/Dev_Blackpill_F401CC
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.variant_h=variant_BLACKPILL_F401Cx.h
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.cmsis_lib_gcc=arm_cortexM4lf_math

# Upload menu
Dev_boards.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Dev_boards.menu.upload_method.swdMethod.upload.protocol=0
Dev_boards.menu.upload_method.swdMethod.upload.options=-g
Dev_boards.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Dev_boards.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Dev_boards.menu.upload_method.serialMethod.upload.protocol=1
Dev_boards.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
Dev_boards.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Dev_boards.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Dev_boards.menu.upload_method.dfuMethod.upload.protocol=2
Dev_boards.menu.upload_method.dfuMethod.upload.options=-g
Dev_boards.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

Dev_boards.menu.upload_method.clipboard=Clipboard (Copy Path)
Dev_boards.menu.upload_method.clipboard.upload.protocol=0
Dev_boards.menu.upload_method.clipboard.upload.options=-g
Dev_boards.menu.upload_method.clipboard.upload.tool=clipboard_upload

################################################################################
# Nucleo 64 boards

Nucleo_64.name=Nucleo-64

Nucleo_64.build.core=arduino
Nucleo_64.build.board=Nucleo_64
Nucleo_64.build.variant_h=variant_{build.board}.h
Nucleo_64.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
Nucleo_64.upload.maximum_size=0
Nucleo_64.upload.maximum_data_size=0

# NUCLEO_F401RE board
Nucleo_64.menu.pnum.NUCLEO_F401RE=Nucleo F401RE
Nucleo_64.menu.pnum.NUCLEO_F401RE.node="NODE_F401RE,NUCLEO"
Nucleo_64.menu.pnum.NUCLEO_F401RE.upload.maximum_size=524288
Nucleo_64.menu.pnum.NUCLEO_F401RE.upload.maximum_data_size=98304
Nucleo_64.menu.pnum.NUCLEO_F401RE.build.mcu=cortex-m4
Nucleo_64.menu.pnum.NUCLEO_F401RE.build.fpu=-mfpu=fpv4-sp-d16
Nucleo_64.menu.pnum.NUCLEO_F401RE.build.float-abi=-mfloat-abi=hard
Nucleo_64.menu.pnum.NUCLEO_F401RE.build.board=NUCLEO_F401RE
Nucleo_64.menu.pnum.NUCLEO_F401RE.build.series=STM32F4xx
Nucleo_64.menu.pnum.NUCLEO_F401RE.build.product_line=STM32F401xE
Nucleo_64.menu.pnum.NUCLEO_F401RE.build.variant=STM32F4xx/F401R(B-C-D-E)T
Nucleo_64.menu.pnum.NUCLEO_F401RE.build.cmsis_lib_gcc=arm_cortexM4lf_math

# NUCLEO_F411RE board
Nucleo_64.menu.pnum.NUCLEO_F411RE=Nucleo F411RE
Nucleo_64.menu.pnum.NUCLEO_F411RE.node="NODE_F411RE,NUCLEO"
Nucleo_64.menu.pnum.NUCLEO_F411RE.upload.maximum_size=524288
Nucleo_64.menu.pnum.NUCLEO_F411RE.upload.maximum_data_size=131072
Nucleo_64.menu.pnum.NUCLEO_F411RE.build.mcu=cortex-m4
Nucleo_64.menu.pnum.NUCLEO_F411RE.build.fpu=-mfpu=fpv4-sp-d16
Nucleo_64.menu.pnum.NUCLEO_F411RE.build.float-abi=-mfloat-abi=hard
Nucleo_64.menu.pnum.NUCLEO_F411RE.build.board=NUCLEO_F411RE
Nucleo_64.menu.pnum.NUCLEO_F411RE.build.series=STM32F4xx
Nucleo_64.menu.pnum.NUCLEO_F411RE.build.product_line=STM32F411xE
Nucleo_64.menu.pnum.NUCLEO_F411RE.build.variant=STM32F4xx/F411R(C-E)T
Nucleo_64.menu.pnum.NUCLEO_F411RE.build.cmsis_lib_gcc=arm_cortexM4lf_math

# Upload menu
Nucleo_64.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Nucleo_64.menu.upload_method.swdMethod.upload.protocol=0
Nucleo_64.menu.upload_method.swdMethod.upload.options=-g
Nucleo_64.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Nucleo_64.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Nucleo_64.menu.upload_method.serialMethod.upload.protocol=1
Nucleo_64.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
Nucleo_64.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Nucleo_64.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Nucleo_64.menu.upload_method.dfuMethod.upload.protocol=2
Nucleo_64.menu.upload_method.dfuMethod.upload.options=-g
Nucleo_64.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

