geosmall/Arduino_Core_STM32/boards.txt
GenF4.menu.upload_method.hidMethod=HID Bootloader 2.2
GenF4.menu.upload_method.hidMethod.upload.protocol=hid22
GenF4.menu.upload_method.hidMethod.upload.tool=hid_upload
GenF4.menu.upload_method.hidMethod.build.flash_offset=0x4000
GenF4.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID -DVECT_TAB_OFFSET={build.flash_offset}

################################################################################
# Serialx activation
Flight_ctrl.menu.xserial.generic=Enabled (generic 'Serial')
Flight_ctrl.menu.xserial.none=Enabled (no generic 'Serial')
Flight_ctrl.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Flight_ctrl.menu.xserial.disabled=Disabled (No Serial support)
Flight_ctrl.menu.xserial.disabled.build.xSerial=

Dev_boards.menu.xserial.generic=Enabled (generic 'Serial')
Dev_boards.menu.xserial.none=Enabled (no generic 'Serial')
Dev_boards.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Dev_boards.menu.xserial.disabled=Disabled (No Serial support)
Dev_boards.menu.xserial.disabled.build.xSerial=

Nucleo_64.menu.xserial.generic=Enabled (generic 'Serial')
Nucleo_64.menu.xserial.none=Enabled (no generic 'Serial')
Nucleo_64.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_64.menu.xserial.disabled=Disabled (No Serial support)
Nucleo_64.menu.xserial.disabled.build.xSerial=

Disco.menu.xserial.generic=Enabled (generic 'Serial')
Disco.menu.xserial.none=Enabled (no generic 'Serial')
Disco.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Disco.menu.xserial.disabled=Disabled (no Serial support)
Disco.menu.xserial.disabled.build.xSerial=

GenF4.menu.xserial.generic=Enabled (generic 'Serial')
GenF4.menu.xserial.none=Enabled (no generic 'Serial')
GenF4.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF4.menu.xserial.disabled=Disabled (no Serial support)
GenF4.menu.xserial.disabled.build.xSerial=

# USB connectivity
Flight_ctrl.menu.usb.none=None
Flight_ctrl.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
Flight_ctrl.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
Flight_ctrl.menu.usb.CDC=CDC (no generic 'Serial')
Flight_ctrl.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
Flight_ctrl.menu.xusb.FS=Low/Full Speed
Flight_ctrl.menu.xusb.HS=High Speed
Flight_ctrl.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
Flight_ctrl.menu.xusb.HSFS=High Speed in Full Speed mode
Flight_ctrl.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

Dev_boards.menu.usb.none=None
Dev_boards.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
Dev_boards.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
Dev_boards.menu.usb.CDC=CDC (no generic 'Serial')
Dev_boards.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
Dev_boards.menu.xusb.FS=Low/Full Speed
Dev_boards.menu.xusb.HS=High Speed
Dev_boards.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
Dev_boards.menu.xusb.HSFS=High Speed in Full Speed mode
Dev_boards.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

Nucleo_64.menu.usb.none=None
Nucleo_64.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
Nucleo_64.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
Nucleo_64.menu.usb.CDC=CDC (no generic 'Serial')
Nucleo_64.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
Nucleo_64.menu.xusb.FS=Low/Full Speed
Nucleo_64.menu.xusb.HS=High Speed
Nucleo_64.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
Nucleo_64.menu.xusb.HSFS=High Speed in Full Speed mode
Nucleo_64.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

Disco.menu.usb.none=None
Disco.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
Disco.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
Disco.menu.usb.CDC=CDC (no generic 'Serial')
Disco.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
Disco.menu.xusb.FS=Low/Full Speed
Disco.menu.xusb.HS=High Speed
Disco.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
Disco.menu.xusb.HSFS=High Speed in Full Speed mode
Disco.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

# Optimizations
Flight_ctrl.menu.opt.ogstd=Debug (-Og)
Flight_ctrl.menu.opt.ogstd.build.flags.optimize=-Og
Flight_ctrl.menu.opt.osstd=Smallest (-Os default)
Flight_ctrl.menu.opt.oslto=Smallest (-Os) with LTO
Flight_ctrl.menu.opt.oslto.build.flags.optimize=-Os -flto
Flight_ctrl.menu.opt.o1std=Fast (-O1)
Flight_ctrl.menu.opt.o1std.build.flags.optimize=-O1
Flight_ctrl.menu.opt.o1lto=Fast (-O1) with LTO
Flight_ctrl.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Flight_ctrl.menu.opt.o2std=Faster (-O2)
Flight_ctrl.menu.opt.o2std.build.flags.optimize=-O2
Flight_ctrl.menu.opt.o2lto=Faster (-O2) with LTO
Flight_ctrl.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Flight_ctrl.menu.opt.o3std=Fastest (-O3)
Flight_ctrl.menu.opt.o3std.build.flags.optimize=-O3
Flight_ctrl.menu.opt.o3lto=Fastest (-O3) with LTO
Flight_ctrl.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Flight_ctrl.menu.opt.o0std=No Optimization (-O0)
Flight_ctrl.menu.opt.o0std.build.flags.optimize=-O0

Dev_boards.menu.opt.ogstd=Debug (-Og)
Dev_boards.menu.opt.ogstd.build.flags.optimize=-Og
Dev_boards.menu.opt.osstd=Smallest (-Os default)
Dev_boards.menu.opt.oslto=Smallest (-Os) with LTO
Dev_boards.menu.opt.oslto.build.flags.optimize=-Os -flto
Dev_boards.menu.opt.o1std=Fast (-O1)
Dev_boards.menu.opt.o1std.build.flags.optimize=-O1
Dev_boards.menu.opt.o1lto=Fast (-O1) with LTO
Dev_boards.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Dev_boards.menu.opt.o2std=Faster (-O2)
Dev_boards.menu.opt.o2std.build.flags.optimize=-O2
Dev_boards.menu.opt.o2lto=Faster (-O2) with LTO
Dev_boards.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Dev_boards.menu.opt.o3std=Fastest (-O3)
Dev_boards.menu.opt.o3std.build.flags.optimize=-O3
Dev_boards.menu.opt.o3lto=Fastest (-O3) with LTO
Dev_boards.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Dev_boards.menu.opt.o0std=No Optimization (-O0)
Dev_boards.menu.opt.o0std.build.flags.optimize=-O0

